[
  {
    "id": "1",
    "text": "Description: eSchool Portal | Modern School Information Management System. eSchool the preferred choice for educational institutions worldwide. eSchool Portal is a comprehensive, AI-powered school management system offering integrated solutions for student enrollment, attendance, grades, communication, and online learning. Empower your educational institution with our user-friendly platform. Keywords: eSchool Portal, school management system, student information system, AI-powered education, online learning platform, school ERP, digital classrooms, education technology, school administration software, eSchool Lebanon.",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "Description"
    }
  },
  {
    "id": "2",
    "text": "Characteristics: Most Advanced School Systems in Mena, School Management System, Learning Management System, Content Management System. 2.Empower your school with AI. 3.Build the future of your school. 4.Engage your school community. 5.All in one integrated ERP system",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "Characteristics"
    }
  },
  {
    "id": "3",
    "text": "Why eSchool?: Efficient Report Generation: Streamline your school's reporting process with efficient printing of financial statements, certificates, and grades. Our user-friendly system ensures all requirements are met with speed and accuracy. 24/7 Expert Support: Access round-the-clock expert support and training to ensure prompt service delivery. We address all your questions and inquiries with speed and efficiency, keeping your operations smooth. Seamless User Experience: Enjoy a user-friendly, clear, and intuitive experience designed for educators, students, and parents alike. Our platform makes managing school activities simple and enjoyable. Robust Data Protection: Secure your sensitive school data with our robust protection measures. We ensure secure access control based on job descriptions, safeguarding all stored information. Quality Monitoring & Supervision: Monitor and supervise the educational process to ensure smooth operations and quality control. Track progress and maintain high standards across all school activities. Comprehensive Digital Services: Offer a wide range of online services including student enrollment, online registration, and secure payment of fees. Simplify administrative tasks with our integrated digital platform. Eco-Friendly & Cost-Effective: Reduce costs, burden alleviation, and environmental protection by going paperless. Achieve significant cost savings while contributing to environmental sustainability. Empowering Educators: Equip your teachers with powerful tools for detailed student assessments, attendance management, and behavior tracking. Enhance teaching effectiveness and student engagement. Interactive Online Learning: Deliver education through our comprehensive online platform, offering interactive lessons and the ability to create a complete virtual school environment. Advanced Operations Tracking: Track operations through comprehensive financial reports, administrative records, statistical analysis, and visual representations for informed decision-making. Smart Attendance Management: Efficiently manage employee attendance and absenteeism through a dedicated application with unique features designed for educational institutions. Digital Textbook Solution: Alleviate the burden of school bags by digitizing textbooks and eliminating the need for physical copies. Modern learning made accessible and portable. Accreditation Support: Assist your school in achieving accreditation with comprehensive documentation, reporting, and compliance tools designed to meet educational standards. Enhanced Parent Engagement: Enable parents to conveniently request certificates and schedule appointments with the administration. Facilitate seamless communication between all stakeholders. Ministry of Education Compliance: Highly aligned with the requirements of the Ministry of Education and major educational institutions, seamlessly integrating into the network of affiliated schools nationwide. Digital Memory Preservation: Create a uniquely distinctive yearbook for the school, capturing precious memories in a remarkable way that celebrates your institution's achievements and milestones. Multi-Stakeholder Communication: Facilitate communication between the administrative body, educational faculty, parents, and students through integrated messaging and collaboration tools.",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "Why eSchool?"
    }
  },
  {
    "id": "4",
    "text": "Platform Audience: Built for Every Role in Your School Community. Our platform adapts to meet the unique needs of students, parents, teachers, and administrators, creating a unified educational ecosystem. Students, Smart Learners. Access your lessons, exams, and school updates from anywhere. Learn, collaborate, and stay informed through a personalized platform. Features: Course Materials & Videos, Timetable & Agenda View, Online Exams & Results, Messaging with Teachers Parents, Informed Guardians. Monitor your child's academic life in real time — grades, attendance, bus tracking, and more — all from one app. Features: Real-Time Grades & Attendance, Bus & School Notifications, Teacher & Admin Messaging, Calendar of Events Teachers, Academic Leaders. Simplify lesson delivery, grading, and student tracking with smart tools tailored for teaching efficiency. Features: Digital Lesson Plans & Uploads, Grading & Mark Entry, Student Performance Analytics, Attendance Recording Administrators, Operational Experts. Control academic, financial, and admin operations across all departments from one centralized dashboard. Features: Dashboard with Key Metrics, Staff & Student Management, Financial & Fee Tracking, Compliance & Reports",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "Platform Audience"
    }
  },
  {
    "id": "5",
    "text": "Insights: 9.1 million agendas. 4.7 million resources. 2.1 million live classes. 171.9 thousand online exams.",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "Insights"
    }
  },
  {
    "id": "6",
    "text": "School Management Features: Everything your school needs to operate efficiently, engage effectively, and educate excellently—all integrated in one comprehensive platform. Learning Management System (LMS): A robust platform for managing digital learning experiences. It includes: Course Management, Digital Resources, Student Collaboration School Information System (SIS): Centralized management of all school operations and records. It includes: Student Information, Attendance & Grades, Timetables Content Management System (CMS): Organize and deliver structured educational content. It includes: Curriculum Mapping, Lesson Planning, Document Storage Live Classes: Real-time virtual classrooms to enhance student engagement. It includes: Interactive Sessions, Whiteboard & Screen Sharing, Class Recordings Analytics & Insights: Actionable data to drive educational decisions. It includes: Performance Metrics, Engagement Reports, Custom Dashboards Unified Portal: A single platform for parents, students, and teachers to connect and stay informed. It includes: Announcements, Progress Monitoring, Messaging & Updates",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "School Management Features"
    }
  },
  {
    "id": "7",
    "text": "What Our Clients Say: eSchool is a versatile platform that was able to adopt and transform the learning process from the in class teaching to online teaching in a smooth and effective manner. The platform is comprehensive and covers all aspects of the learning process. Its ability to be a platform where the school can offer online classes , agenda, e-library, online assessment and many other features makes it a must have for today’s education needs. Written by: Dr. Jimmy Choufani, School Principal انطلاقا من تجربة اكرا كومينيتي سكول والتي هي مدرسة لبنانية موجودة في غانا- أفريقيا، حيث أن المدرسة رائدة في المجال التكنولوجي والتقني، تعددت التجارب التي تتعلق بالبرامج التي تعنى بعملية إدارة المدرسة،التعليم عن بعد،الصف المباشر،.. بعض هذه البرامج كانت مجانية وبعضها غير مجاني ومنها برامج عالمية،حيث أن لكل برنامج ميزة خاصة به، ولكن ما وجدناه في برنامج ايسكول لم نجده في غيره من البرامج. عملية التكامل والقدرة على الربط بين كل الخدمات والأقسام الموجودة في البرنامج أعطانا القدرة للوصول بطريقة أسهل للأهل والطلاب من خلال الاستعانة بالخدمات حتى نتمكن من التواصل والربط ليصبح كل عملنا متكامل،وهذا ما تمكنت ايسكول من انجازه على عكس غيرها من البرامج. أما طاقم ايسكول،فلديه القدرة على تلبية الحاجات بشكل سريع،حل المشاكل بشكل سريع، وهذا مؤشر على أن مستقبل هذه الشركة سيكون مستقبل زاهر على الصعيد العالمي. برنامج ايسكول هو برنامج مختلف ومميز ولديه القدرة على اعطاء حل شامل وكامل لأي مؤسسة تعليمية. Written by: Ali Taleb, School Principal يتميّز برنامج eSchool بأنّه أنشئ بناءً على أفكار معلّمين وإداريّين ورؤساء مدارس ما جعله برنامجًا عمليًّا ناجحًا وسهل الاستخدام من قبل الأهل والتلاميذ والمعلّمين، ويتماشى مع كلّ الأوضاع والتغيّرات، كما يتميّز هذا البرنامج بأنّه يغطّي معظم حاجات العمل الإداريّ من خلال (eSchool administration) بالإضافة إلى خدمات التّعليم عن بعد وإثبات نجاحه في هذا المجال، مع الإشارة إلى وجود فريق دعم متعاون رغم الضغط الشديد عليه. Written by: Hussein Abdel Sater, Vice president | Chief Information Officer eSchool is a greatly efficient and user friendly program that allows students to study remotely and enables teachers to continuously communicate and follow up with their students. Additionally, it is important to note the prompt response of the support service at eSchool that never fails to assist whenever any issue is raised. Written by: Dana Fayad Rafei, Financial manager ان الجمعية الحميدية الخيرية الإسلامية وبعد استخدامها لبرنامج eSchool وتطبيقاته المختلفة ساعدت على توثيق التواصل مع الأهل لمتابعة التلميذ تربوياً، خاصة في فترة التعليم عن بعد.إضافة إلى ذلك ساهم برنامج eSchool في تسهيل وتنظيم العمل الإداري والمالي في مدارس الجمعية بكافة فروعها.نشكر إدارة شركة eSchool والعاملين فيها على تقديم الخدمات والتحديثات المتعددة والمتواصلة وعلى جهوزيتهم الدائمة في الرد على كافة الاستفسارات والتساؤلات، متمنين لكم المزيد من التطور والنجاح. Written by: Lawyer Khaled Mohammed Al-Zoubi, president في ظلّ جائحة كورونا وما نتج عنها من توقّف للتّعليم الحضوريّ، عزمنا على متابعة مسيرتنا التّربويّة والتّعليميّة بأفضل وأحدث الوسائل. ولنصل الى هدفنا، بحثنا عن أفضل الشّركات التّكنولوجيّة الّتي تسمح لنا بمواكبة أبنائنا عبر التّعلّم عن بعد. ووقع اختيارنا على شركة eSchool، وطبعًا لم نخطئ في قرارنا. فقد حرص القيّمون عليها على تقديم أفضل الخدمات التّقنيّة الّتي تساعدنا على تحقيق أهدافنا التّربويّة والتّعليميّة. وأخذت الشّركة بعين الاعتبار تقييمنا المستمرّ للخدمات المقدّمة لتقديم الأفضل. وقد أثمر التّعاون بيننا عمليّة تربويّة ناجحة عن بعد في كلّ المقاييس وضعتنا في المقدّمة مع أفضل المؤسّسات التّربويّة. Written by: Mr. Rawad Hawash, Educational Director It's an honor for us to receive this certificate. We would like to thank you and your team for all the support you gave and for always being there. We wish you continuous success in your business. Thank you. Written by: Mrs. Rabab Abdullah Juma, Director The eSchool program implemented at our school, The National Evangelical School in Nabatieh, provides a comprehensive set of services designed to address various administrative and academic processes. It offers an efficient grading system that guarantees accuracy and transparency in recording and managing student grades. The system also manages financial files flawlessly, enabling the school to maintain organized records of fees and transactions. Moreover, eSchool supports the definition and management of courses, allowing for clear structuring and customization to meet academic needs. The program's team is highly cooperative, addressing all concerns with professionalism and promptness, ensuring that users encounter minimal interruption and maximum assistance. Written by: Shadi El Hajjar, School Principal Après notre expérience de travail avec eSchool, il est important de partager notre avis avec vous. Grâce à eSchool Administaration, nous avons organisé le travail administratif dans tous les départements de l'école, tant au niveau administratif que financier. De plus, les applications en ligne d'eschool ont contribué à faciliter le processus éducatif et pédagogique. Enfin, nous tenons à remercier les responsables, les employés et les formateurs de eSchool pour leur suivi rigoureux et persévérant du travail à l'école. Nous sommes fiers de notre partenariat avec cette entreprise pionnière dans le domaine de la technologie. Written by: Antonio Maksoud, IT Manager",
    "metadata": {
      "page_title": "eSchool Home Page",
      "url": "https://web.myeschoolhome.com/",
      "section_title": "What Our Clients Say"
    }
  },
  {
    "id": "8",
    "text": "CEO Quote: Education is the compass that guides us toward a brighter future, equipping us with the knowledge and skills to navigate life's challenges and pursue our dreams. — Oussama Ezzedine, CEO",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "CEO Quote"
    }
  },
  {
    "id": "9",
    "text": "At a Glance: At a Glance. Our global impact in numbers. Key statistics include: Countries: +10; Students: +1 M; Teachers: +500 K.",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "At a Glance"
    }
  },
  {
    "id": "10",
    "text": "Our Journey - 2007: Empowering Education Through Innovation. Our company’s dedication to spearheading digital transformation in education across Arab educational institutions became a priority. We envisioned a future where innovative technologies enhance learning experiences, making education more accessible and impactful for everyone. Our mission was and is still to collaborate with stakeholders to build robust digital infrastructure, develop tailored educational resources, and advocate for policies that support the integration of technology in education.",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "Our Journey - 2007"
    }
  },
  {
    "id": "11",
    "text": "Our Journey - 2019: Our Significant Milestone. During the COVID-19 pandemic, our live classes feature achieved significant milestones by creating an educational online platform that provided students with uninterrupted learning opportunities. The platform was highly secure and efficient, allowing teachers and administrators to maintain control over the educational process seamlessly. It boasted a vast library of over 1 million digital educational videos, offering diverse and comprehensive resources for all subjects. Despite the challenges posed by online teaching, our students achieved excellent results, effectively bridging the educational gap created by the pandemic.",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "Our Journey - 2019"
    }
  },
  {
    "id": "12",
    "text": "Our Journey - 2023: Empowering Education: Now and Beyond. In the present and looking toward the future, eSchool company has forged integration agreements with leading educational companies to enhance our curriculum. These partnerships empower our educational offerings by supplementing the school curriculum presented by teachers in the classroom. Students now have access to a rich array of educational videos directly related to their subjects, allowing them to deepen and reinforce their knowledge. This integration ensures a more comprehensive and engaging learning experience, bridging classroom instruction with high-quality digital content.",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "Our Journey - 2023"
    }
  },
  {
    "id": "13",
    "text": "Our Journey - Today: Leading Innovation. eSchool company stands as a beacon of educational excellence in the digital realm. With years of innovation and dedication under our belt, we continue to redefine the landscape of learning, adapting to the evolving needs of students and educators alike. Our commitment to providing top-tier digital school services remains unwavering, as we strive to empower learners and facilitate seamless educational experiences. From interactive lessons to collaborative platforms, we remain at the forefront of educational technology, shaping the future of learning with every click and connection.",
    "metadata": {
      "page_title": "About eSchool",
      "url": "https://web.myeschoolhome.com/about",
      "section_title": "Our Journey - Today"
    }
  },
  {
    "id": "14",
    "text": "Overview: Contact Us | Get in Touch with eSchool Team. Have questions or need support? Reach out to the eSchool team for product inquiries, partnerships, or customer service assistance. We're here to help. eschool contact, get in touch, school software support, edtech contact, education solutions inquiry, eschool Lebanon.",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Overview"
    }
  },
  {
    "id": "15",
    "text": "Get in Touch | Phone number Lebanon 1: +961 81 853 832",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Lebanon 1"
    }
  },
  {
    "id": "16",
    "text": "Get in Touch | Phone number Lebanon 2: +961 3 623 352",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Lebanon 2"
    }
  },
  {
    "id": "17",
    "text": "Get in Touch | Phone number Lebanon 3: +961 76 764 252",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Lebanon 3"
    }
  },
  {
    "id": "18",
    "text": "Get in Touch | Phone number Iraq: +964 786 113 8857",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Iraq"
    }
  },
  {
    "id": "19",
    "text": "Get in Touch | Phone number Oman: +968 90 123 757",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Oman"
    }
  },
  {
    "id": "20",
    "text": "Get in Touch | Phone number Turkey: +90 507 925 7501",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Phone number Turkey"
    }
  },
  {
    "id": "21",
    "text": "Get in Touch | WhatsApp: +961 81 853 832 +961 76 764 252",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | WhatsApp"
    }
  },
  {
    "id": "22",
    "text": "Get in Touch | Email: info@eschooledu.com",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Email"
    }
  },
  {
    "id": "23",
    "text": "Get in Touch | Location Address: Hamra - Sanayeh, Beirut, Lebanon, BAC Center building, Third floor",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Address"
    }
  },
  {
    "id": "24",
    "text": "Get in Touch | Facebook: https://www.facebook.com/eschooledu/#",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Facebook"
    }
  },
  {
    "id": "25",
    "text": "Get in Touch | Instagram: https://www.instagram.com/eschool.leb/?igshid=OGQ2MjdiOTE%3D",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Instagram"
    }
  },
  {
    "id": "26",
    "text": "Get in Touch | LinkedIn: https://www.linkedin.com/company/eschool-edu/",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | LinkedIn"
    }
  },
  {
    "id": "27",
    "text": "Get in Touch | Send Us a Message: Fill the form on website, fill you First Name, Last Name, Email, Phone, and Message",
    "metadata": {
      "page_title": "Contact Us",
      "url": "https://web.myeschoolhome.com/contact",
      "section_title": "Get in Touch | Send Us a Message"
    }
  },
  {
    "id": "28",
    "text": "Overview: Insights & Articles | Education Technology Blog by eSchool. Read expert insights, guides, and thought leadership articles on digital education, school management, and the future of learning from the eSchool team. eschool blog, education articles, school management tips, edtech blog, digital learning, school leadership, modern education.",
    "metadata": {
      "page_title": "Blogs",
      "url": "https://web.myeschoolhome.com/blog",
      "section_title": "Overview"
    }
  },
  {
    "id": "29",
    "text": "Introducing AI in eSchool Apps: Smarter and More Effective Planning by: Batoul Ezzeddine / Content and Media Coordinator on: 08-10-2025: As part of eSchool's mission to enhance the educational process and support schools with innovative tools, we have added Artificial Intelligence (AI) features to our services. These new tools are designed to simplify lesson planning and curriculum organization, helping schools and teachers save time while improving efficiency. Key Features: 1. Flexible Curriculum Selection: Schools can easily set the curriculum they follow, which will serve as the foundation for AI-generated goals and plans. 2. Subjects and Grades Integration: Subjects and grade levels should first be linked making curriculum management more organized and accurate. 3. Generate Learning Objectives: The system automatically creates clear learning objectives for each subject and grade, aligned with the chosen curriculum. 4. Generate Yearly Plan: AI distributes objectives and learning units across the school year, ensuring full curriculum coverage in a structured way. 5. Generate Lesson Plan: Teachers can instantly create detailed lesson plans based on yearly objectives, saving preparation time and focusing on quality teaching. The features not only reduce the workload for teachers and administrators but also improve the quality and consistency of education. With AI integration, schools can now achieve smarter planning, better organization, and more effective teaching outcomes.",
    "metadata": {
      "page_title": "Blogs",
      "url": "https://web.myeschoolhome.com/blog",
      "section_title": "Introducing AI in eSchool Apps: Smarter and More Effective Planning by: Batoul Ezzeddine / Content and Media Coordinator on: 08-10-2025"
    }
  },
  {
    "id": "30",
    "text": "The Impact of Technology on Education: A Revolutionary Shift by: Rana Hamadeh/ Trainer on:12-03-2025: The Impact of Technology on Education: As the world evolves rapidly, technology has become a core driver of social development—particularly in education. As a blogger passionate about learning innovations, I have observed the dramatic transformation technology brings to teaching and learning. With the rise of online resources, digital tools, and interactive platforms, students are no longer confined to textbooks or classrooms. Today, education is more accessible, flexible, and personalized than ever before Here’s how technology is reshaping the educational landscape: 1. Learning Anytime, Anywhere: Technology enables students to access a wealth of resources anytime, anywhere. Whether through academic videos, articles, or online lectures, learners can now study at their convenience—perfect for working students or remote learners balancing multiple responsibilities. 2. Tailored Learning Experiences: Personalized learning has become central to educational platforms. With AI tutors, adaptive learning paths, and instant feedback systems, students can learn at their own pace and in ways that suit their individual strengths. 3. Enhanced Collaboration & Communication: Tools like video conferencing, virtual classrooms, and shared workspaces have made collaboration seamless. Students and educators can interact in real-time across continents, enhancing the overall learning experience and building essential communication skills. Here’s how technology is reshaping the educational landscape: 4. Engaging Learning Tools: Gamification, simulations, and interactive apps are replacing static lectures. These tools turn learners into active participants, making lessons fun, immersive, and memorable—while increasing knowledge retention. 5. Preparing Students for the Workforce: Beyond academics, technology builds vital future skills like digital fluency, problem-solving, and creativity. Platforms teaching coding or virtual collaboration tools are equipping students for tech-driven job markets. 6. Smarter Administration and Assessment: For educators, technology simplifies grading, attendance, and tracking student progress. Data analytics highlight learning gaps, enabling timely intervention and improving student outcomes overall. Conclusion: The role of technology in education is undeniable. It breaks barriers, personalizes learning, and prepares students for a digital future. As we embrace these advancements, we pave the way for better, more inclusive education worldwide. 'Whether you're a teacher or a student, remember: the future of education is in your hands—and technology is here to empower you!'",
    "metadata": {
      "page_title": "Blogs",
      "url": "https://web.myeschoolhome.com/blog",
      "section_title": "The Impact of Technology on Education: A Revolutionary Shift by: Rana Hamadeh/ Trainer on:12-03-2025"
    }
  },
  {
    "id": "31",
    "text": "Overview: School Events & Updates | eSchool Community Activities. Stay updated with the latest events, workshops, and educational activities happening within the eSchool network. Empowering school communities through engagement and shared experiences. school events, eschool activities, education events, school community, student engagement, workshops, academic calendar.",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Overview"
    }
  },
  {
    "id": "32",
    "text": "Quote: Education empowers us by unlocking our latent talents and providing us with the knowledge and skills needed to overcome challenges. By: OUSSAMA EZZEDDINE – CEO, on December 12, 2022 Learn more: https://web.myeschoolhome.com/news-events",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Quote"
    }
  },
  {
    "id": "33",
    "text": "Innovation in Technology and STEAM Curriculum – 2025/2026 on 21-08-2025: On August 21, 2025, in collaboration with ACTC Center and ACT College, and under the supervision of Professor Radwan Choueib (President of the National Authority for Science and Research and General Supervisor of the Center for Advanced Informatics and Curriculum), a public presentation was held on the new curriculum adopted for the academic year 2025/2026 titled: Innovation in Technology and STEAM. Learn more: https://web.myeschoolhome.com/news-events/NGY69mBqLkz Training Highlights: During the two-day training session, 30 teachers from various schools were trained on using the Arduino kit as well as the Scratch programming platform. The training emphasized hands-on implementation of STEAM principles through interactive tools, fostering innovation and practical application in classrooms. Learn more: https://web.myeschoolhome.com/news-events/NGY69mBqLkz Hands-On Learning Experience: Participants had the opportunity to engage directly with hardware and software tools, learn about the integration of coding into lesson plans, and explore practical scenarios that empower students through STEAM education. Learn more: https://web.myeschoolhome.com/news-events/NGY69mBqLkz Program Completion: At the conclusion of the course, certificates of completion were distributed to the participating teachers in recognition of their commitment and successful engagement in the program. Learn more: https://web.myeschoolhome.com/news-events/NGY69mBqLkz",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Innovation in Technology and STEAM Curriculum – 2025/2026 on 21-08-2025"
    }
  },
  {
    "id": "34",
    "text": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Beirut on 06-03-2025: eSchool organized its second conference titled 'Exploring Education Horizons Through Artificial Intelligence' at Galleria hotel in Beirut, Lebanon. The conference was attended by a large number of school principals, curriculum supervisors, and coordinators. Learn more: https://web.myeschoolhome.com/news-events/8Q2YaYV9PdM Mr. Osama Ezzeddine, CEO of eSchool, welcomed the attendees and emphasized the school's role in community building, highlighting the importance of digital transformation in enhancing educational quality. He also outlined eSchool's forward-looking vision, highlighting the strategic integration of artificial intelligence into the eSchool platform. He drew attention to the company's partnerships with leading global providers of interactive digital educational content, aimed at enriching the learning experience and making it more accessible and engaging for students. He concluded by calling for a redefinition for the concept of schooling by offering modern, humane education that cultivates knowledgeable generations. Learn more: https://web.myeschoolhome.com/news-events/8Q2YaYV9PdM Following that, Ms. Rana Hamadeh, Head of the Training Department, provided a detailed overview of eSchool's applications, highlighting key services and features. She discussed the upcoming AI-powered tools to be introduced in the next academic year and detailed the interactive digital content for educational materials. The conference concluded with networking sessions and side discussions among supporters and participants. Learn more: https://web.myeschoolhome.com/news-events/8Q2YaYV9PdM",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Beirut on 06-03-2025"
    }
  },
  {
    "id": "35",
    "text": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Chtaura on 15-05-2025: About the Conference: eSchool organized its second conference titled 'Exploring Education Horizons Through Artificial Intelligence' at Park Hotel in Chtaura, Lebanon. The event gathered numerous school principals, curriculum supervisors, and educational coordinators. Learn more: https://web.myeschoolhome.com/news-events/P05ZajJaW8E CEO's Vision: Mr. Osama Ezzeddine, CEO of eSchool, welcomed attendees with a keynote speech, emphasizing the school's role in community development. He highlighted the significance of digital transformation in improving education and outlined eSchool's vision for integrating artificial intelligence into its platform. Learn more: https://web.myeschoolhome.com/news-events/P05ZajJaW8E Global Collaborations: Mr. Ezzeddine also shed light on the company's collaborations with global leaders in digital educational content, aimed at enriching the student learning experience with engaging and accessible resources. He concluded with a call to redefine education through modern, human-centered approaches that build knowledgeable and capable generations. Learn more: https://web.myeschoolhome.com/news-events/P05ZajJaW8E Platform Innovations: Ms. Rana Hamadeh, Head of the Training Department, followed with a comprehensive presentation on eSchool's applications, showcasing key services and upcoming AI-powered tools set to launch in the next academic year. She also presented the platform's interactive digital educational content in detail. Learn more: https://web.myeschoolhome.com/news-events/P05ZajJaW8E Networking & Collaboration: The conference concluded with lively networking sessions and productive discussions among participants and eSchool supporters, fostering new partnerships and innovative ideas for the future of education. Learn more: https://web.myeschoolhome.com/news-events/P05ZajJaW8E",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Chtaura on 15-05-2025"
    }
  },
  {
    "id": "36",
    "text": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Tripoli on 03-05-2025: eSchool organized its second conference titled 'Exploring Education Horizons Through Artificial Intelligence' at Dar Al Amar restaurant in Tripoli, North Lebanon. The event brought together numerous school principals, curriculum supervisors, and coordinators. Learn more: https://web.myeschoolhome.com/news-events/w238rBoabOj Mr. Osama Ezzeddine, CEO of eSchool, welcomed the attendees and emphasized the school's critical role in community building. He highlighted the importance of digital transformation for enhancing educational quality and outlined eSchool's forward-looking vision, including the strategic integration of artificial intelligence into the eSchool platform. He also underscored the company's partnerships with leading global providers of interactive digital educational content, aimed at enriching the student learning experience and making it more accessible and engaging. He concluded by calling for a redefinition of the concept of schooling—one that offers modern, humane education designed to cultivate knowledgeable, empowered generations. Learn more: https://web.myeschoolhome.com/news-events/w238rBoabOj Following this, Ms. Rana Hamadeh, Head of the Training Department, delivered a detailed overview of eSchool's applications, highlighting its key services and features. She also discussed the upcoming AI-powered tools to be introduced in the next academic year and detailed the interactive digital content available for educational materials. The conference concluded with engaging networking sessions and productive side discussions among supporters and participants. Learn more: https://web.myeschoolhome.com/news-events/w238rBoabOj",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Tripoli on 03-05-2025"
    }
  },
  {
    "id": "37",
    "text": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Oman. on 30-04-2025: eSchool organized its second conference titled 'Exploring Educational Horizons Through Artificial Intelligence' at the Platinum Hotel, Muscat, Oman. The event was honored by the presence of Mr. Nabil bin Abdullah Al Khunbashi, Head of the Curriculum Department at the Ministry of Education, along with a large audience of school principals, educational supervisors, and curriculum coordinators. Learn more: https://web.myeschoolhome.com/news-events/zM0B9MlapK8 In the opening speech, Mr. Nabil emphasized the growing importance of artificial intelligence and its relevance to eSchool's mission. He highlighted how seizing such opportunities can elevate institutional and school performance. Mr. Osama Ezzeddine, CEO of eSchool, welcomed the distinguished guests and stressed the vital role schools play in community development. He outlined eSchool's vision for digital transformation and AI integration, emphasizing partnerships with global leaders in interactive digital educational content to enrich student learning in an accessible and engaging way. He concluded by calling for a redefinition of schooling, aiming to provide modern, humane education that fosters well-informed generations. Learn more: https://web.myeschoolhome.com/news-events/zM0B9MlapK8 Ms. Rana Hamadeh, Head of the Training Department, provided a comprehensive overview of eSchool's applications, showcasing key features and services. She also introduced the AI-powered tools to be launched in the coming academic year and detailed the interactive digital content available for educators. Learn more: https://web.myeschoolhome.com/news-events/zM0B9MlapK8 Several school principals shared their successful experiences with the eSchool system, discussing improvements in administrative, financial, and educational performance. They praised eSchool's excellent post-sales support, including ongoing training and technical assistance. Learn more: https://web.myeschoolhome.com/news-events/zM0B9MlapK8 The conference concluded with the distribution of honorary shields to participating principals, followed by networking sessions and side discussions among attendees. Learn more: https://web.myeschoolhome.com/news-events/zM0B9MlapK8",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Oman. on 30-04-2025"
    }
  },
  {
    "id": "38",
    "text": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Akkar, North Lebanon on 26-04-2025: eSchool organized its second conference titled 'Exploring Education Horizons Through Artificial Intelligence' at Grassias Hotel in Akkar, North Lebanon. The event brought together a large number of school principals, curriculum supervisors, and coordinators. Mr. Osama Ezzeddine, Chairman of the Board, welcomed attendees and emphasized the school's role in community building, highlighting the importance of digital transformation in enhancing educational quality. He presented eSchool’s forward-looking vision and its strategic integration of AI, alongside global partnerships aimed at enriching the student learning experience. He concluded by calling for a redefinition of schooling—promoting modern, humane education that nurtures informed future generations. Learn more: https://web.myeschoolhome.com/news-events/5YQB9Reaob4 Following that, Ms. Rana Hamadeh, Head of the Training Department, provided an overview of eSchool's applications, detailing key services and features. She highlighted upcoming AI-powered tools for the next academic year and elaborated on interactive digital educational content. The conference concluded with networking sessions and engaging side discussions among attendees. Learn more: https://web.myeschoolhome.com/news-events/5YQB9Reaob4",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "Exploring the Horizons of Education through Artificial Intelligence – eSchool Conference, Akkar, North Lebanon on 26-04-2025"
    }
  },
  {
    "id": "39",
    "text": "The role of Technology in developing educational and administrative process on 03-03-2025: We are proud to highlight a significant milestone in eSchool's journey through the event titled 'The Role of Technology in Developing Educational and Administrative Processes', held in North Lebanon. This event showcased how eSchool leverages modern technology to meet students' needs and empower their educational journey. It attracted participation from most of the region's schools, whose representatives expressed keen interest and heartfelt appreciation for our contributions to the educational system. The conference served as a vibrant platform for educators to explore innovative solutions and reaffirmed our commitment to enhancing education through technological advancement. Learn more: https://web.myeschoolhome.com/news-events/g43Maz2ajdl",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "The role of Technology in developing educational and administrative process on 03-03-2025"
    }
  },
  {
    "id": "40",
    "text": "eSchool Online Courses & Training Program on 30-12-2024: eSchool is thrilled to launch its online training courses for individuals interested in our innovative educational platform. These courses offer comprehensive instruction on how to use and implement our system and applications within real educational environments. High-achieving participants are offered unique opportunities to work directly with us. We provide school placements where trainees can gain hands-on experience. Those who excel may also become official eSchool representatives both in Lebanon and internationally. This program is ideal for aspiring educators and tech enthusiasts looking to jumpstart their careers. By joining, participants not only enhance their professional skills but also contribute meaningfully to the advancement of modern education. Learn more: https://web.myeschoolhome.com/news-events/LyzZa0orEKW",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "eSchool Online Courses & Training Program on 30-12-2024"
    }
  },
  {
    "id": "41",
    "text": "eSchool x Highlights Platform Integration on 10-09-2024: On September 10, 2022, we proudly announced our collaboration with the Highlights Platform, a renowned American platform featuring an extensive library of interactive English stories and books. This partnership brings thousands of engaging stories and videos to the eSchool Connect app, enabling teachers to incorporate them seamlessly into live sessions. The platform enhances student language skills, fluency, and accents. Teachers can share Highlights content during live classes, while students interact directly with stories. Student progress is automatically tracked, with detailed reports available for teachers. With quizzes, rewards, and fun learning activities, this integration significantly enriches the online learning experience and boosts student engagement and language proficiency. Learn more: https://web.myeschoolhome.com/news-events/1nWlaOga6zA",
    "metadata": {
      "page_title": "News and Events",
      "url": "https://web.myeschoolhome.com/news-events",
      "section_title": "eSchool x Highlights Platform Integration on 10-09-2024"
    }
  },
  {
    "id": "42",
    "text": "Overview: This is a Our Products | Comprehensive School Management Solutions – eSchool. Explore eSchool's suite of digital products designed to streamline education operations—ranging from attendance tracking and grade reporting to financial and communication tools for modern schools.Keywords: eschool products, school software, education technology, attendance system, gradebook software, school financial tools, online school platform, school digital transformation",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "Overview"
    }
  },
  {
    "id": "43",
    "text": "eSchool Connect: Seamless communication between parents, teachers, and students. Features: Parent Portal. Teacher Chat. Student Community Learn more: https://web.myeschoolhome.com/products/connect",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Connect"
    }
  },
  {
    "id": "44",
    "text": "eSchool Agenda: Smart scheduling and calendar management for all school activities. Features: Event Management. Class Scheduling. Deadline Tracking Learn more: https://web.myeschoolhome.com/products/agenda",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Agenda"
    }
  },
  {
    "id": "45",
    "text": "eSchool Gradebook: Comprehensive grade management and progress tracking. Features: Grade Analytics. Progress Reports. Assessment Tools Learn more: https://web.myeschoolhome.com/products/gradebook",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Gradebook"
    }
  },
  {
    "id": "46",
    "text": "eSchool Content: Rich digital content library and learning resources. Features: Digital Library. Interactive Content. Resource Sharing Learn more: https://web.myeschoolhome.com/products/content",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Content"
    }
  },
  {
    "id": "47",
    "text": "eSchool Exams: Digital examination system with automated grading. Features: Online Testing. Auto Grading. Result Analytics Learn more: https://web.myeschoolhome.com/products/exams",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Exams"
    }
  },
  {
    "id": "48",
    "text": "eSchool Safety: Comprehensive security and compliance management. Features: Access Control. Emergency Protocols. Compliance Tracking Learn more: https://web.myeschoolhome.com/products/safety",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Safety"
    }
  },
  {
    "id": "49",
    "text": "eSchool Administrator: It centralizes administrative tasks, financial tracking, and educational content, fostering a cohesive and organized environment for effective school management.. Features: Administrative Tasks. Financial Tracking. Content Management Learn more: https://web.myeschoolhome.com/products/administrator",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Administrator"
    }
  },
  {
    "id": "50",
    "text": "eSchool Room: It provides a robust platform that engages students with interactive content, and effective educational experience.. Features: Interactive Content. Student Engagement. Educational Experience Learn more: https://web.myeschoolhome.com/products/room",
    "metadata": {
      "page_title": "All Products",
      "url": "https://web.myeschoolhome.com/products",
      "section_title": "eSchool Room"
    }
  },
  {
    "id": "51",
    "text": "Overview: This is a School Administration Platform | eSchool Administrator. Complete School Management. It centralizes administrative tasks, financial tracking, and educational content, fostering a cohesive and organized environment for effective school management. Centralize administrative tasks, financial tracking, and content management with eSchool Administrator.Keywords: eschool administrator, school management, financial tracking, content management Google Play:  App Store:  Web Version:",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Overview"
    }
  },
  {
    "id": "52",
    "text": "Financial File: It handles student enrollment, exam scheduling, and financial transactions, including discounts and fees, with documents automatically sent to the accounting department. Transfers are managed through registration, using the eSchool Driver and Safety app for monitoring. Clubs are defined and students enrolled, generating specific lists. The cafeteria issues cards linked to balances for purchases, directly connected to accounting. Financial reports enable analysis of revenue, installments, and overdue payments, with reminders sent to parents via the eSchool Connect app. It deals with defining financial accounts and cost centers, linking payment vouchers and daily entries to these centers to obtain profit and loss results for each center. The school can control its expenses through various program settings linked to the budget. It includes several accounting statements that can be extracted from the trial balance, account statement, accounts receivable statement, cash flow statement, etc. Assets management allows for the preparation of asset purchase invoices and their automatic transfer to accounting, tracking maintenance for each asset to monitor its consumption and transfer its book value at the end of the financial cycle to accounting. Mechanisms management involves entering all information related to the school's machinery, daily maintenance, and recording incidents, with multiple reports extracted accordingly. It is responsible for defining the school's warehouses, including defining items and linking them to categories so that users can generate sales invoices or point of sale transactions, enter purchase invoices, and delivery and receipt orders within the school departments, which are then directly transferred to the accounting department. Additionally, various reports are available, such as item movement statements, profit and loss statements at the item level, inventory lists, item sales by cost centers, and more. It manages routes, vehicles, and student assignments for efficient commuting. It includes features like route definition, vehicle details, student allocation, real-time tracking, and communication for updates and safety measures, enhancing transportation logistics for the school community.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Financial File"
    }
  },
  {
    "id": "53",
    "text": "Learning File: It facilitates the establishment of a structured framework for documenting both positive and negative behavioral incidents concerning students, aligning each observation with appropriate actions. Upon entry of any behavioral observation for a student, automatic notifications are dispatched to parents via the eSchool connect application. It boasts a comprehensive student profile section, encapsulating all essential information about each student. From academic records to extracurricular activities, attendance, and contact details, parents gain a holistic view of their child's educational journey, fostering informed involvement and support. It assesses prospective students seeking admission, storing all exam information and providing analytical reports to school administrators for informed decision-making.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Learning File"
    }
  },
  {
    "id": "54",
    "text": "Academic File: It manages the class grades policy, subjects, and teacher assignments. It allows for customized assessments for individual students and generates various reports for administrators to monitor student progress. Additionally, it facilitates the printing and distribution of certificates and includes a section for assessing kindergarten students based on defined goals and competencies. Supervisors delineate the objectives and criteria pertinent to each subject. A series of forms are crafted encompassing subject-specific objectives and observation criteria. Reports: This segment facilitates the generation of customized reports for individual supervisors, highlighting their completed tasks and activities. It manages the tasks of educational counselors, including student support and case management, connecting them to individual student records and statistical data.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Academic File"
    }
  },
  {
    "id": "55",
    "text": "Security File: This section ensures user rights are safeguarded. It covers privacy policies, data protection measures, and guidelines for responsible usage, promoting a secure environment for all.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Security File"
    }
  },
  {
    "id": "56",
    "text": "Archive File: It encompasses data on alumni through regularly updated forms, facilitating ongoing communication between the school and its graduates. Additionally, it generates statistical reports on the academic and professional trajectories of alumni. It manages the cataloging of library books and facilitates the borrowing process for both students and teachers, both within and outside the school premises. It oversees the coordination of activities, events, and ceremonies, including the management of invitations sent and received by the school. It helps Archiving session minutes, outgoing and incoming correspondence, and assigned tasks for individuals.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Archive File"
    }
  },
  {
    "id": "57",
    "text": "Employee File: It allows users to input personal, administrative, academic, and financial info for employees and teachers. Applicants can apply online or in person, and acceptance is based on interviews or tests. Each employee has a file covering financial, insurance, compensation, loans, contracts, and salary details. Salaries are calculated and sent via eSchool Connect app, with deductions for insurance, compensation, and taxes. The system facilitates tax declarations, annual settlements, and financial obligations to the compensation fund and insurance.",
    "metadata": {
      "page_title": "eSchool Administrator",
      "url": "https://web.myeschoolhome.com/products/administrator",
      "section_title": "Employee File"
    }
  },
  {
    "id": "58",
    "text": "Overview: This is a Smart School Scheduling | eSchool Agenda. A Paperless Agenda. Organize assignments, deadlines, and live classes all in one eco-friendly planner. Manage school events, classes, and deadlines efficiently with eSchool Agenda.Keywords: eschool agenda, school calendar, event management, scheduling, deadline tracking Google Play: https://play.google.com/store/apps/details?id=com.eschool.agenda App Store: https://apps.apple.com/us/app/eschool-agenda/id1434284896 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "Overview"
    }
  },
  {
    "id": "59",
    "text": "A Paperless Agenda: Elevate your student life with our innovative paperless electronic agenda. Say farewell to juggling papers and hello to effortless organization tailored for students. Whether it's keeping track of assignments, deadlines, or extracurricular activities, our digital agenda is your ultimate companion for academic success. Stay ahead of the curve while reducing paper waste, making a positive impact on both your grades and the planet. Embrace the future of student productivity with our user-friendly and eco-conscious agenda – because your success starts with staying organized, digitally.",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "A Paperless Agenda"
    }
  },
  {
    "id": "60",
    "text": "Capture your live classes and discussions with our journal.:",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "Capture your live classes and discussions with our journal."
    }
  },
  {
    "id": "61",
    "text": "Effortless Organizer: Transform your student life with our dynamic homework organizer. Seamlessly navigate assignments, deadlines, and study sessions, empowering you to excel academically while staying organized and focused. With intuitive features tailored for students, including progress tracking and deadline reminders, our platform becomes your indispensable companion throughout your academic journey. Embrace efficiency and success with our dedicated homework organizer, and make the most of your student experience.",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "Effortless Organizer"
    }
  },
  {
    "id": "62",
    "text": "Empowering Parents to Stay Informed.: Empower yourself with real-time insights into your child's academic journey. Our app is more than just a tracking app; it's your partner in understanding and supporting your child's attitude and behavior at school. Receive instant updates on attendance, performance, and behavior, keeping you informed and involved every step of the way. With intuitive features and personalized notifications, you can proactively address any concerns and celebrate achievements together. Stay connected, stay informed, and nurture your child's success with our tracking app.",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "Empowering Parents to Stay Informed."
    }
  },
  {
    "id": "63",
    "text": "Master your moments, seize the day, and reign supreme with our time-saving, life-organizing digital agenda!:",
    "metadata": {
      "page_title": "eSchool Agenda",
      "url": "https://web.myeschoolhome.com/products/agenda",
      "section_title": "Master your moments, seize the day, and reign supreme with our time-saving, life-organizing digital agenda!"
    }
  },
  {
    "id": "64",
    "text": "Overview: This is a Parent-Teacher Online Communication Platform | eSchool Connect. School Communication. A secure communication platform uniting teachers, parents, and students. Integrated within eSchool LMS and mobile app, it supports smooth, safe communication across your school community. Enhance online communication between parents, students, and teachers with eSchool Connect. Stay updated with messages, announcements, and school updates in real-time.Keywords: eschool connect, parent-teacher communication, school notifications, online school messaging, real-time updates, school announcements Google Play: https://play.google.com/store/apps/details?id=xdk.intel.cordova.eSchoolApp App Store: https://apps.apple.com/us/app/eschool-connect/id1056313709 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Overview"
    }
  },
  {
    "id": "65",
    "text": "Messages, Discussions and Rooms: This feature provides students with a powerful platform that facilitates vibrant communication and discussions, fostering engaging dialogues and collaborative learning opportunities within the school setting. It enhances the educational experience by encouraging interactive exchanges and shared knowledge among students. It includes Rooms section which allows participants to have live meetings, Messages section which insurers efficient communication among students, parents, teachers and administration. Last there is the Discussions section of which teachers can discuss various issues through scheduled chatting live with students.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Messages, Discussions and Rooms"
    }
  },
  {
    "id": "66",
    "text": "Posts: Tool that simplifies the exchange of posts between teachers and parents, creating a streamlined platform that enhances the distribution of pertinent information. This fosters efficient communication within the school community, promoting collaboration and engagement between educators and parents for the benefit of the students.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Posts"
    }
  },
  {
    "id": "67",
    "text": "Comments, Likes: Parents are given the opportunity to actively participate in the school community through the app's features, allowing them to comment on and express appreciation for various posts. By enabling interactions such as commenting and liking, the app not only facilitates communication but also cultivates a sense of community within the parental network. This engagement not only strengthens the connection between parents and educators but also creates a collaborative atmosphere where shared insights, questions, and positive feedback contribute to a more vibrant and supportive school environment.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Comments, Likes"
    }
  },
  {
    "id": "68",
    "text": "Resources, Ebook, Shelves and Shared folder: It provides students with a user-friendly interface, allowing them to effortlessly explore an extensive library that encompasses both traditional and digital book resources. This seamless navigation enhances the overall academic experience, as students can easily access a diverse range of materials tailored to their educational needs. Whether opting for conventional textbooks or embracing the convenience of e-books, the app creates a dynamic environment for enriched academic exploration, promoting self-directed learning and catering to various learning preferences.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Resources, Ebook, Shelves and Shared folder"
    }
  },
  {
    "id": "69",
    "text": "Online Polls, Statistics, Evaluations: It offers parents a seamless experience by allowing effortless access to comprehensive statistical data and polls. This user-friendly platform empowers parents to stay well-informed about their child's educational journey. Through the app, they can efficiently review academic performance metrics, attendance records, and other relevant statistics. Additionally, the inclusion of polls facilitates parent engagement, enabling them to contribute feedback and opinions on various aspects of their child's schooling experience. This collaborative and accessible approach not only keeps parents informed but also actively involves them in supporting and enhancing their child's educational progress.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Online Polls, Statistics, Evaluations"
    }
  },
  {
    "id": "70",
    "text": "HR Services: An integrated Human Resources (HR) service is provided, significantly streamlining administrative processes related to personnel management. This feature offers a centralized platform where staff can efficiently handle various HR matters. From managing employee records and facilitating leave requests to handling payroll and other administrative tasks, the integrated HR service enhances organizational efficiency. By consolidating these functions within the app, the school not only simplifies its administrative workload but also ensures a more organized and accessible approach to human resource management, contributing to a smoother overall operation.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "HR Services"
    }
  },
  {
    "id": "71",
    "text": "Grades, objectives, behavior, and everything that contributes to creating a complete student's portfolio: The school app's comprehensive student file goes beyond mere academic grades, encompassing a wide range of essential information such as goals, behavioral records, and other pertinent details. This feature establishes a holistic and centralized approach to student development and assessment. By consolidating diverse aspects of a student's educational journey in one place, the app provides educators and administrators with a comprehensive view of each student's progress, strengths, and areas for improvement. This centralized student file not only aids in academic evaluation but also facilitates a more informed and personalized approach to support each student's growth. Educators can track individual goals, monitor behavioral patterns, and collaborate effectively to ensure a well-rounded educational experience. This holistic perspective enhances the overall understanding of students' needs, contributing to a more tailored and effective educational environment.",
    "metadata": {
      "page_title": "eSchool Connect",
      "url": "https://web.myeschoolhome.com/products/connect",
      "section_title": "Grades, objectives, behavior, and everything that contributes to creating a complete student's portfolio"
    }
  },
  {
    "id": "72",
    "text": "Overview: This is a Digital Learning Resources | Upload & Share Educational Content – eSchool. Digital Learning Resources. Rich digital content library and learning resources platform that delivers educational materials—articles, videos, interactive content—to support student learning. Distribute educational materials and digital content through eSchool. Empower teachers and students with access to files, lectures, and multimedia resources.Keywords: eschool content, digital education materials, learning resources, e-learning platform, school content sharing, online lectures Google Play: https://play.google.com/store/apps/details?id=eschool.apps.eschoolshelves App Store: https://apps.apple.com/us/app/eschool-content/id1296241492 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Content",
      "url": "https://web.myeschoolhome.com/products/content",
      "section_title": "Overview"
    }
  },
  {
    "id": "73",
    "text": "Features: Voice Record .  Links .  HTML Pages .  Videos .  Text .  Youtube Link .  Images . Voice Record .  Links .  HTML Pages .  Videos .  Text .  Youtube Link .  Images .",
    "metadata": {
      "page_title": "eSchool Content",
      "url": "https://web.myeschoolhome.com/products/content",
      "section_title": "Features"
    }
  },
  {
    "id": "74",
    "text": "Download Books with an Offline Preview: It offers book downloading feature, allowing users to download textbooks and resources for offline access. This ensures learning continuity even without an internet connection, promoting flexibility and accessibility for students and faculty. Additionally, it supports sustainability by reducing the need for printed materials.",
    "metadata": {
      "page_title": "eSchool Content",
      "url": "https://web.myeschoolhome.com/products/content",
      "section_title": "Download Books with an Offline Preview"
    }
  },
  {
    "id": "75",
    "text": "Annotation Tools: Annotation with brush tool feature allows students to annotate directly on documents and presentations, enhancing engagement and interaction. It encourages creativity, collaboration, and personalized learning while facilitating real-time feedback and communication. It empowers students to engage actively with digital content, enhancing comprehension and fostering creativity. They enable personalized feedback from teachers and promote collaboration, making learning more interactive and effective.",
    "metadata": {
      "page_title": "eSchool Content",
      "url": "https://web.myeschoolhome.com/products/content",
      "section_title": "Annotation Tools"
    }
  },
  {
    "id": "76",
    "text": "Navigation Tools: The Navigation Tools feature simplifies access to information and resources with intuitive menus, search options, and clear categorization. It includes a \"Go to Page\" feature, enabling users to quickly navigate to specific sections or pages within the app. Additionally, thumbnails provide visual cues, further enhancing navigation efficiency by allowing users to preview content before accessing it. This ensures efficient navigation, saving time and enhancing usability for students, faculty, and staff.",
    "metadata": {
      "page_title": "eSchool Content",
      "url": "https://web.myeschoolhome.com/products/content",
      "section_title": "Navigation Tools"
    }
  },
  {
    "id": "77",
    "text": "Overview: This is a Exam Management System | Schedule & Track School Exams – eSchool. Digital Examination System. Digital examination system with automated grading and comprehensive exam management features. Organize exams efficiently with eSchool. Plan exam schedules, publish results, and provide students with seamless access to performance feedback.Keywords: eschool exams, exam scheduling, school assessments, student results, online exam platform, exam results management Google Play:  App Store:  Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F#/!/home",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Overview"
    }
  },
  {
    "id": "78",
    "text": "Online Exam: The online exam streamlines assessment procedures by facilitating remote, timed examinations with automated grading and comprehensive analytical insights. This professional tool enhances efficiency and engagement in educational processes while providing educators with valuable data-driven feedback for continuous improvement.",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Online Exam"
    }
  },
  {
    "id": "79",
    "text": "Paper Exam: The main body of a book or other piece of writing, as distinct from other material such as notes, appendices, and illustrations.",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Paper Exam"
    }
  },
  {
    "id": "80",
    "text": "Varied Question Types: Easily you have a range of question types, such as multiple-choice, true/false, short answer, essay, and multimedia questions. These diverse options accommodate various assessment needs, catering to different learning styles and educational objectives within a professional setting.",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Varied Question Types"
    }
  },
  {
    "id": "81",
    "text": "Features: Set time limits for each exam . Allow students to see all correct answers at the end of exam . Indicate the difficulty level for each question . Possibility to add the answers as attachment file . Set time limits for each exam . Allow students to see all correct answers at the end of exam . Indicate the difficulty level for each question . Possibility to add the answers as attachment file .",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Features"
    }
  },
  {
    "id": "82",
    "text": "Streamlining Exam Results with Online Tools: Teachers can efficiently manage exam results using an online exam app by saving them directly to the cloud. With the ability to export results to Gradebook, a dedicated app, educators can seamlessly update grades and access detailed statistics in the summary service. This streamlined process enhances organization, simplifies data management, and provides valuable insights for informed decision-making in educational assessment.",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Streamlining Exam Results with Online Tools"
    }
  },
  {
    "id": "83",
    "text": "Tracking Exam Objectives with Online App Analytics: Teachers can use the online exam to set exam's objectives and then check how well students meet these objectives. The app's analytics provide insights into the percentage of objectives reached by each student, allowing teachers to assess alignment between exam performance and set objectives efficiently.",
    "metadata": {
      "page_title": "eSchool Exams",
      "url": "https://web.myeschoolhome.com/products/exams",
      "section_title": "Tracking Exam Objectives with Online App Analytics"
    }
  },
  {
    "id": "84",
    "text": "Overview: This is a Online Gradebook System | Real-Time Student Grades – eSchool. Grades Made Smarter. The eSchool Gradebook is an all-in-one digital tool that allows teachers to record, manage, and share student grades in real time. It simplifies grading, supports transparent academic communication, and helps schools maintain accurate performance records effortlessly. Track and manage student performance with eSchool’s Gradebook. Access real-time grades, averages, and assessment reports for transparent academic tracking.Keywords: eschool gradebook, student grades online, digital report card, academic performance tracking, online assessment, school grading system Google Play: https://play.google.com/store/apps/details?id=com.eschool.gradebook App Store: https://apps.apple.com/us/app/eschool-gradebook/id1322901106 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Gradebook",
      "url": "https://web.myeschoolhome.com/products/gradebook",
      "section_title": "Overview"
    }
  },
  {
    "id": "85",
    "text": "eSchool Gradebook enhances teachers' productivity by facilitating: Seamless communication:Streamlining the sharing of comments among teachers and managers to ensure effective collaboration and feedback exchange. Comprehensive organization:Structuring lessons, objectives, and sub-objectives systematically to optimize teaching strategies and student learning outcomes. Tailored scheduling:Enabling the customization of specific schedules for each teacher to maximize efficiency and resource allocation.",
    "metadata": {
      "page_title": "eSchool Gradebook",
      "url": "https://web.myeschoolhome.com/products/gradebook",
      "section_title": "eSchool Gradebook enhances teachers' productivity by facilitating"
    }
  },
  {
    "id": "86",
    "text": "Prepare Easily by Using Our Daily Planner: Harness the power of the Daily Planner to meticulously prepare lessons, ensuring thorough organization of steps, resources, and objectives. With this tool, you can seamlessly attach files and images, fostering enriched learning experiences. Furthermore, facilitate effective communication by sharing comments with managers, fostering collaboration and alignment with organizational goals.",
    "metadata": {
      "page_title": "eSchool Gradebook",
      "url": "https://web.myeschoolhome.com/products/gradebook",
      "section_title": "Prepare Easily by Using Our Daily Planner"
    }
  },
  {
    "id": "87",
    "text": "Organize Your Student's Grades, Behavior Status and Remarks: Develop an integrated student management system incorporating grade tracking, behavioral assessments, and remarks. This system will seamlessly integrate with the school's calendar, enabling teachers to schedule assignments and exams for students while providing the flexibility to attach relevant materials to the agenda.",
    "metadata": {
      "page_title": "eSchool Gradebook",
      "url": "https://web.myeschoolhome.com/products/gradebook",
      "section_title": "Organize Your Student's Grades, Behavior Status and Remarks"
    }
  },
  {
    "id": "88",
    "text": "Set Your Weekly Calendar and Annual Objectives: Our integrated school calendar facilitates seamless assignment and exam management for teachers, empowering them to add tasks and assessments for students while offering the functionality to attach supplementary materials. This comprehensive platform streamlines academic planning and ensures efficient communication within the educational community.",
    "metadata": {
      "page_title": "eSchool Gradebook",
      "url": "https://web.myeschoolhome.com/products/gradebook",
      "section_title": "Set Your Weekly Calendar and Annual Objectives"
    }
  },
  {
    "id": "89",
    "text": "Overview: This is a Live Online Classes | Virtual Learning Platform – eSchool. Virtual Classroom Platform. It provides a robust platform that engages students with interactive content, and effective educational experience through virtual classroom features. Deliver interactive virtual classes with eSchool Live. Host real-time lessons, share presentations, and engage students in a secure online classroom.Keywords: eschool live class, virtual classroom, online teaching, real-time school classes, digital lessons, remote learning platform Google Play: https://play.google.com/store/apps/details?id=com.eschool.liveclass App Store: https://apps.apple.com/us/app/eschool-rooms/id1585677892 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Overview"
    }
  },
  {
    "id": "90",
    "text": "Productive Meetings: eSchool Rooms offers a dynamic learning environment with whiteboard writing, video, and voice communication for real-time interaction. Features like commenting, media sharing, quizzes, and polls enhance engagement and comprehension, while recording sessions ensure accessibility. Interactive chat fosters communication and community among students and instructors, creating an immersive and effective online learning experience.",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Productive Meetings"
    }
  },
  {
    "id": "91",
    "text": "Simple Scheduling: Teachers can easily schedule meetings through our school app by accessing the scheduling feature, where they can specify the date, time, and duration of the meeting. Additionally, teachers have the option to choose who can enter the meeting as well. This ensures privacy and allows for tailored discussions. By providing these customizable options, teachers can efficiently organize meetings that suit their schedules and preferences, fostering effective communication between parents, teachers, and students.",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Simple Scheduling"
    }
  },
  {
    "id": "92",
    "text": "Give teachers the access to easily manage the room:",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Give teachers the access to easily manage the room"
    }
  },
  {
    "id": "93",
    "text": "Create a Webinar from Agenda App: Teachers are able to create engaging webinars for students. This fosters interactive learning, allowing for group discussions, presentations, and real-time participation. The feature enhances student engagement and fosters a sense of community in the virtual classroom.",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Create a Webinar from Agenda App"
    }
  },
  {
    "id": "94",
    "text": "Record Your meetings, activities, shared screens and find it archived:",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Record Your meetings, activities, shared screens and find it archived"
    }
  },
  {
    "id": "95",
    "text": "Ensuring Safety: The application ensures security through encryption, secure login credentials, and regular updates. We prioritize user privacy and conduct security audits to maintain a safe learning environment for all users.",
    "metadata": {
      "page_title": "eSchool Room",
      "url": "https://web.myeschoolhome.com/products/room",
      "section_title": "Ensuring Safety"
    }
  },
  {
    "id": "96",
    "text": "Overview: This is a School Safety & Attendance Monitoring | Secure Student Check-ins – eSchool. Always Know They’re Safe. eSchool Safety is a sophisticated mobile application designed for parents to seamlessly track their children's school bus in real-time, providing invaluable peace of mind. Ensure student safety with real-time attendance tracking, secure bus monitoring, and digital check-in systems via the eSchool platform.Keywords: eschool safety, student check-in, school attendance monitoring, student bus tracking, school security system, digital attendance Google Play: https://play.google.com/store/apps/details?id=com.eschool.safety App Store: https://apps.apple.com/us/app/eschool-safety/id1239307419 Web Version: https://www.myeschoolhome.com/account/login.html?lang=en&target=%2F",
    "metadata": {
      "page_title": "eSchool Safety",
      "url": "https://web.myeschoolhome.com/products/safety",
      "section_title": "Overview"
    }
  },
  {
    "id": "97",
    "text": "Features:",
    "metadata": {
      "page_title": "eSchool Safety",
      "url": "https://web.myeschoolhome.com/products/safety",
      "section_title": "Features"
    }
  },
  {
    "id": "98",
    "text": "Easy Tracking for Parents: With our intuitive school app, parents can effortlessly track multiple children as they travel home on their respective buses. Through a user-friendly interface, parents can conveniently switch between their children's profiles, ensuring seamless monitoring and peace of mind throughout the journey.",
    "metadata": {
      "page_title": "eSchool Safety",
      "url": "https://web.myeschoolhome.com/products/safety",
      "section_title": "Easy Tracking for Parents"
    }
  },
  {
    "id": "99",
    "text": "Secure School Bus Communication: With real-time notifications and live GPS tracking, parents can stay updated on bus delays and bus’s locations. Crucially, two-way communication allows direct contact with the bus driver for safety reassurance. Customizable alerts, emergency notifications, and easy feedback options streamline communication. Integrated with school systems, our user-friendly app supports multi-child households, prioritizing safety and peace of mind for families.",
    "metadata": {
      "page_title": "eSchool Safety",
      "url": "https://web.myeschoolhome.com/products/safety",
      "section_title": "Secure School Bus Communication"
    }
  }
]